OdGeExtents3d.op_Inequality(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeExtents3d object.
\returns
A boolean value that indicates whether the input Extents object is not identical to this Extents object.

OdGeExtents3d.op_Equality(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for the OdGeExtents3d object.
\returns
A boolean value that indicates whether the input Extents object is identical to this Extents object.

OdGeExtents3d.isEqualTo(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks if this Extents object is equal to the passed Extents object.
\param extents [in]  A 3D Extents object to be compared for equality.
\param tol [in]  Geometric tolerance.
\remarks
This method compares this object to the passed object by testing the equivalence of their definition points.
If the points match within the range specified by tolerance, this method returns true. Otherwise, it returns false.

OdGeExtents3d.setFrom2d(OdGeExtents2d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d.Convert2dPlane)
\details
Sets minimum and maximum points for this Extents object from a passed 2D Extents object.
\param extents [in]  A 2D Extents object from which conversion is calculated.
\param plane [in]  Plane on which the 2D Extents object lies.
\remarks
This method sets 0 to the coordinate on the axis that is absent in the passed 2D Extents object.

OdGeExtents3d.convert2d(OdGeExtents2d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d.Convert2dPlane)
\details
Converts this 3D Extents object to a 2D Extents object.
\param extents [out]  Resulting converted 2D Extents object.
\param plane [in]  Plane according to which conversion is calculated.
\remarks
This method sets minimum and maximum 2D points of this Extents object, eliminating one of the axes.

OdGeExtents3d.diagonal
\details
Returns the vector from minimum to maximum point.

OdGeExtents3d.center
\details
Returns a center point of this Extents object.

OdGeExtents3d.isWithinRange(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Checks whether the box intersects the sphere with specified center and radius.
\param pt [in]  A 3D point that represents the sphere center.
\param radius [in]  A radius of the sphere.

OdGeExtents3d.intersectWith(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeExtents3d*)
\details
Determines the intersection of the specified Extents object with this one,
and returns the resulting intersection box.
\param extents [in]  Any 3D Extents object.
\param pResult [out]  Receives extents of the intersection.
\remarks
pResult object should be created by the caller. Possible return values are as follows.
@untitled table
kIntersectUnknown   Either or both extents boxes are invalid
kIntersectNot       The extents boxes are NOT intersecting
kIntersectOpIn      The specified Extents object is completely within this one
kIntersectOpOut     This Extents object is completely within the specified one
kIntersectOk        The extents boxes are intersecting, and a result is returned

OdGeExtents3d.distanceTo(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns 0.0 if point is inside the box or euclidean distance in other case

OdGeExtents3d.isDisjointEuclidean(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Same as isDisjoint, but checks precisely whether minimal Euclidean distance is greater than tolerance.

OdGeExtents3d.isDisjoint(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if specified Extents object
does not intersect this one.
\param extents [in]  Any 3D Extents object.

OdGeExtents3d.contains(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this Extents object contains the specified extents.
\param extents [in]  A 3D Extents object that is tested to be within this extents.
\param tol [in]  Geometric tolerance.

OdGeExtents3d.contains(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if this Extents object contains the specified point.
\param point [in]  A 3D point that is presumably contained inside this extents.
\param tol [in]  Geometric tolerance.

OdGeExtents3d.expandBy(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this Extents object by the specified vector.
\param vect [in]  A 3D vector that defines where new points are located.

OdGeExtents3d.isValidExtents
\details
Returns true if and only if this Extents object contains valid extents.
\remarks
Extents are valid if and only if each member of the minimum extents
is less than or equal to the corresponding member of maximum extents.

OdGeExtents3d.addExt(OdGeExtents3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this Extents object with the specified array of points.
\param points [in]  Array of 3D points to define the extents.

OdGeExtents3d.addPoints(OdArray&lt;OdGePoint3d,OdMemoryAllocator&lt;OdGePoint3d&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this Extents object with the specified point.
\param point [in]  A 3D point that is added to define new extents.

OdGeExtents3d.addPoint(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Updates the extents of this Extents object with the specified point.
\param point [in]  Any 3D point.

OdGeExtents3d.comparingSet(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the minimum and maximum points for this Extents object to
that of the box defined by pt1 and pt2.
\param pt1 [in]  First point that defines the extents.
\param pt2 [in]  Second point that defines the extents.
\remarks
The passed first and second points are only needed to define a box. The points
themselves do not necessarily need to be minimum and maximum points. The
coordinates of the passed points are compared and then set to real minimum and maximum points.

OdGeExtents3d.set(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the minimum and maximum points for this Extents object.
\param min [in]  Minimum point.
\param max [in]  Maximum point.

OdGeExtents3d.op_Subscript(System.Int32)
\details
Returns the vertex of the box depending on index.
Minimum vertex is returned when iIndex = 0, maximum vertex otherwise.

OdGeExtents3d.maxPoint
\details
Returns the maximum point of this Extents object.

OdGeExtents3d.minPoint
\details
Returns the minimum point of this Extents object.